CSI API ETABS v1
cPointObj.GetCoordSpherical Method
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetCoordSpherical(
	string Name,
	ref double R,
	ref double A,
	ref double B,
	string CSys = "Global"
)
Function GetCoordSpherical (
	Name As String,
	ByRef R As Double,
	ByRef A As Double,
	ByRef B As Double,
	Optional CSys As String = "Global"
) As Integer
Dim instance As cPointObj
Dim Name As String
Dim R As Double
Dim A As Double
Dim B As Double
Dim CSys As String
Dim returnValue As Integer
returnValue = instance.GetCoordSpherical(Name,
	R, A, B, CSys)
int GetCoordSpherical(
	String^ Name,
	double% R,
	double% A,
	double% B,
	String^ CSys = L"Global"
)
abstract GetCoordSpherical :
        Name : string *
        R : float byref *
        A : float byref *
        B : float byref *
        ?CSys : string
(* Defaults:
        let _CSys = defaultArg CSys "Global"
*)
-> int
Parameters
Name
Type: System.String
R
Type: System.Double
A
Type: System.Double
B
Type: System.Double
CSys (Optional)
Type: System.String
Return Value
Type: Int32
See Also
Reference
cPointObj Interface
ETABSv1 Namespace